{
    "controls": {
        "help-menu-button": "Help menu",
        "message-box-button": "I watched the execution closely!"
    },

    "header": {
        "title": "Owly, the helping owl",
        "expand": "Expand",
        "close": "Close",
        "shrink": "Shrink",
        "back": "Back"
    },

    "steps": {
        "owl": {
            "no-questions-stage": "It looks like that there are no questions available. This could be, because on our stage there is no Block around!",
            "no-questions-sprite": "It looks like that there are no questions available. This could be, because there is no Block in the selected sprite <i><b>{sprite}</b></i>!",
            "run-action": "Can you please help me narrow it down when the error occurs? For that you have to execute the game and wait till the error pops up.",
            "run-action-completed": "Execute the game and watch closely which sprite is not working properly.",
            "sprite-selection": "Thank you very much! Please select the sprite or the stage where you suspect the error is in.",
            "choose-category": "Splendid! We come closer and closer I can feel it! We are now in the debugger for this sprite. Let’s get deeper: Please choose where we proceed to look next!",
            "choose-question-type-multiple": "According to what you selected we have multiple possible options. Is it something that should happen or should not happen? Please Choose.",
            "choose-question-type-single": "Oh it looks like we have no choice here. According to what you selected we should look in the given category.",
            "finished": "Well done. We now have reached all of the available questions according to what we selected. Try to look for something that might help you find the solution. If you click on a question you can also click on a block where you can look further! Good Luck!"
        },
        "user": {
            "choose-category": "Ok, i choose that ",
            "choose-question-type": "I think it"
        }
    }
}
